stooged/ESP32-Server-900u/ESP32_Server_900u_HTTPS/ESP32_Server_900u_HTTPS.ino
#if INTHEN
    if (path.endsWith("goldhen.bin")) {
      AsyncWebServerResponse *response = request->beginResponse_P(200, "application/octet-stream", goldhen_gz, sizeof(goldhen_gz));
      response->addHeader("Content-Encoding", "gzip");
      request->send(response);
      return;
    }
#endif

    request->send(404);
  });


  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
  server.begin();
  //HWSerial.println("HTTP server started");

  if (TIME2SLEEP < 5) { TIME2SLEEP = 5; }  //min sleep time


  if (FILESYS.exists("/pk.pem") && FILESYS.exists("/cert.der"))
  {
    uint8_t* cBuffer;
    uint8_t* kBuffer;
    unsigned int clen = 0;
    unsigned int klen = 0;
    File certFile = FILESYS.open("/cert.der", "r");
    clen = certFile.size();
    cBuffer = (uint8_t*)malloc(clen);
    certFile.read(cBuffer, clen);
    certFile.close();
    File pkFile = FILESYS.open("/pk.pem", "r");
    klen = pkFile.size();
    kBuffer = (uint8_t*)malloc(klen);
    pkFile.read(kBuffer, klen);
    pkFile.close();
    cert = new SSLCert(cBuffer, clen, kBuffer, klen);
  }else{
    cert = new SSLCert();
    String keyInf = "CN=" + WIFI_HOSTNAME + ",O=Esp32_Server,C=US";
    int createCertResult = createSelfSignedCert(*cert, KEYSIZE_1024, (std::string)keyInf.c_str(), "20190101000000", "20300101000000");
    if (createCertResult != 0) {
      //Serial.printf("Certificate failed, Error Code = 0x%02X\n", createCertResult);
    }else{
      //Serial.println("Certificate created");
      File pkFile = FILESYS.open("/pk.pem", "w");
      pkFile.write( cert->getPKData(), cert->getPKLength());
      pkFile.close();
      File certFile = FILESYS.open("/cert.der", "w");
      certFile.write(cert->getCertData(), cert->getCertLength());
      certFile.close();
    }
  }

  secureServer = new HTTPSServer(cert);
  ResourceNode *nhttps = new ResourceNode("", "ANY", &handleHTTPS);
  secureServer->setDefaultNode(nhttps);
  secureServer->start();

  bootTime = millis();
}


#if defined(CONFIG_IDF_TARGET_ESP32S2) | defined(CONFIG_IDF_TARGET_ESP32S3)
static int32_t onRead(uint32_t lba, uint32_t offset, void *buffer, uint32_t bufsize) {
  if (lba > 4) { lba = 4; }
  memcpy(buffer, exfathax[lba] + offset, bufsize);
  return bufsize;
}

void enableUSB() {
  dev.vendorID("PS4");
  dev.productID("ESP32 Server");
  dev.productRevision("1.0");
  dev.onRead(onRead);
  dev.mediaPresent(true);
  dev.begin(8192, 512);
  USB.begin();
  enTime = millis();
  hasEnabled = true;
}

void disableUSB() {
  enTime = 0;
  hasEnabled = false;
  dev.end();
  ESP.restart();
}
#else
void enableUSB() {
  digitalWrite(usbPin, HIGH);
  enTime = millis();
  hasEnabled = true;
}

void disableUSB() {
  enTime = 0;
  hasEnabled = false;
  digitalWrite(usbPin, LOW);
}
#endif


void loop() {
  if (espSleep && !isFormating) {
    if (millis() >= (bootTime + (TIME2SLEEP * 60000))) {
      //HWSerial.print("Esp sleep");
      esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_PERIPH, ESP_PD_OPTION_OFF);
      esp_deep_sleep_start();
      return;
    }
  }
  if (hasEnabled && millis() >= (enTime + 15000)) {
    disableUSB();
  }
#if !USESD && !USELILYSD
  if (isFormating) {
    //HWSerial.print("Formatting Storage");
    isFormating = false;
    FILESYS.end();
    FILESYS.format();
    FILESYS.begin(true);
    delay(1000);
#if USECONFIG
    writeConfig();
#endif
  }
#endif

  dnsServer.processNextRequest();
  secureServer->loop();
}
